jklim01/ece4191-lesgo/4191_g6/lesgo_g6.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "motor_l_pwm.h"
#include "motor_r_pwm.h"
#include "motor_clk.h"
#include "motor_l_in1_aliases.h"
#include "motor_l_in1.h"
#include "motor_l_in2_aliases.h"
#include "motor_l_in2.h"
#include "motor_r_in1_aliases.h"
#include "motor_r_in1.h"
#include "motor_r_in2_aliases.h"
#include "motor_r_in2.h"
#include "motor_l_quaddec.h"
#include "motor_l_quaddec_PVT.h"
#include "motor_l_phaseA_aliases.h"
#include "motor_l_phaseA.h"
#include "motor_l_phaseB_aliases.h"
#include "motor_l_phaseB.h"
#include "motor_r_phaseA_aliases.h"
#include "motor_r_phaseA.h"
#include "motor_r_quaddec.h"
#include "motor_r_quaddec_PVT.h"
#include "motor_r_phaseB_aliases.h"
#include "motor_r_phaseB.h"
#include "p_controller_isr.h"
#include "p_controller_timer.h"
#include "UART_1.h"
#include "color_sensor_pwm.h"
#include "color_sensor_counter.h"
#include "color_sensor_creg.h"
#include "color_sensor_ready.h"
#include "color_sensor_clk.h"
#include "color_sensor_out_aliases.h"
#include "color_sensor_out.h"
#include "color_sensor_led_aliases.h"
#include "color_sensor_led.h"
#include "color_sensor_s3_aliases.h"
#include "color_sensor_s3.h"
#include "color_sensor_s2_aliases.h"
#include "color_sensor_s2.h"
#include "color_sensor_s1_aliases.h"
#include "color_sensor_s1.h"
#include "color_sensor_s0_aliases.h"
#include "color_sensor_s0.h"
#include "us_b_isr.h"
#include "us_b_echo_aliases.h"
#include "us_b_echo.h"
#include "us_b_timer.h"
#include "us_f_isr.h"
#include "us_f_echo_aliases.h"
#include "us_f_echo.h"
#include "us_f_timer.h"
#include "us_trigger_pwm.h"
#include "us_r_isr.h"
#include "us_r_echo_aliases.h"
#include "us_r_echo.h"
#include "us_r_timer.h"
#include "us_l_isr.h"
#include "us_l_echo_aliases.h"
#include "us_l_echo.h"
#include "us_trigger_aliases.h"
#include "us_trigger.h"
#include "us_l_timer.h"
#include "us_clk.h"
#include "ir_l_out_aliases.h"
#include "ir_l_out.h"
#include "ir_l_posedge_isr.h"
#include "ir_debouncer_clk.h"
#include "ir_l_negedge_isr.h"
#include "ir_r_out_aliases.h"
#include "ir_r_out.h"
#include "ir_r_posedge_isr.h"
#include "ir_r_negedge_isr.h"
#include "ir_side_out_aliases.h"
#include "ir_side_out.h"
#include "ir_side_posedge_isr.h"
#include "ir_side_negedge_isr.h"
#include "motor_l_quaddec_isr.h"
#include "motor_l_quaddec_Cnt16.h"
#include "motor_r_quaddec_isr.h"
#include "motor_r_quaddec_Cnt16.h"
#include "UART_1_IntClock.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

